import 'package:flutter/material.dart';

Color primaryBlack = Color(0xff202c3b);

class DataSource {
  static String qoute = "ঘরে থাকুন, সুস্থ থাকুন";

  static List questionAnswer = [
    {
      "question": "করোনভাইরাস কী?",
      "answer":
          "করোনাভাইরাস, ভাইরাসগুলির একটি বৃহত পরিবার যা প্রাণী বা মানুষের মধ্যে অসুস্থতার কারণ হতে পারে। মানুষের মধ্যে, বেশ কয়েকটি করোনভাইরাসগুলি সাধারণ শৈত্য থেকে মধ্য প্রাচ্যের রেসপিরেটরি সিন্ড্রোম (এমআরএস) এবং গুরুতর তীব্র শ্বাসতন্ত্র সিন্ড্রোম (এসএআরএস) এর মতো আরও মারাত্মক রোগ থেকে শুরু করে শ্বাস প্রশ্বাসের সংক্রমণ ঘটায় বলে জানা যায়। সর্বাধিক সন্ধান পাওয়া করোনাভাইরাস করোনভাইরাস রোগের কোভিড -১৯ এর কারণ।"
    },
    {
      "question": "কোভিড-১৯ কী?",
      "answer":
          "কোভিড-১৯ হ'ল সর্বাধিক সন্ধান পাওয়া করোনভাইরাস দ্বারা সংক্রামক রোগ। এই নতুন ভাইরাস এবং রোগটি 2019 সালের ডিসেম্বরে চীনের উহান শহরে প্রাদুর্ভাব শুরু হওয়ার আগে অজানা ছিল."
    },
    {
      "question": "কোভিড-১৯ এর লক্ষণগুলি কী কী?",
      "answer":
          "কোভিড-১৯ এর সর্বাধিক সাধারণ লক্ষণগুলি হ'ল জ্বর, ক্লান্তি এবং শুকনো কাশি। কিছু রোগীর ব্যথা এবং ব্যথা, অনুনাসিক ভিড়, সর্দি নাক, গলা ব্যথা বা ডায়রিয়া হতে পারে। এই লক্ষণগুলি সাধারণত হালকা হয় এবং ধীরে ধীরে শুরু হয়। কিছু লোক সংক্রামিত হয় তবে কোনও লক্ষণ বিকাশ করে না এবং অসুস্থ বোধ করে না। বেশিরভাগ লোক (প্রায় 80%) বিশেষ চিকিত্সার প্রয়োজন ছাড়াই রোগ থেকে সেরে ওঠে। COVID-19 প্রাপ্ত প্রতি 6 জনের মধ্যে 1 জন গুরুতর অসুস্থ হয়ে পড়ে এবং শ্বাস নিতে অসুবিধা বোধ করে। বয়স্ক ব্যক্তিরা এবং উচ্চ রক্তচাপ, হার্টের সমস্যা বা ডায়াবেটিসের মতো অন্তর্নিহিত চিকিত্সা সমস্যায় গুরুতর অসুস্থ হওয়ার সম্ভাবনা বেশি থাকে। জ্বর, কাশি এবং শ্বাস নিতে সমস্যাযুক্ত ব্যক্তিদের চিকিত্সার পরামর্শ নেওয়া উচিত."
    },
    {
      "question":
          "চীনে করোনাভাইরাস: উৎপত্তি কোথায়, কতো দ্রুত ছড়াতে পারে এবং কেন এতো প্রাণঘাতী",
      "answer":
          "বিশেষজ্ঞদের ধারণা, যে ধরনের করোনাভাইরাস থেকে সার্স ও মার্স ভাইরাসের জন্ম হয়েছিল এবং এখন নতুন করে যে ভাইরাসের প্রকোপ দেখা দিয়েছে সেগুলোর কোনটির উৎপত্তি মানুষ থেকে হয়নি। বরং এসবের জন্ম হয়েছে প্রাণী থেকে।অনেক প্রাণীই তাদের শরীরে বিপদজনক ভাইরাস বহন করে কিন্তু আমাদের সৌভাগ্য যে এসব ভাইরাস এক লাফে মানবদেহে চলে আসতে পারে না।বেশিরভাগ ক্ষেত্রেই একটি বাধা আছে এবং ভাইরাসটি সেই বাধা অতিক্রম করতে পারে না",
    },
    {
      "question": "কোভিড-১৯ কীভাবে ছড়ায়?",
      "answer":
          "সংক্রমিত ব্যক্তির শ্বাসতন্ত্রের ফোঁটার (কাশি এবং হাঁচির মাধ্যমে তৈরী) সাথে সরাসরি যোগাযোগের মাধ্যমে এবং এই ভাইরাস দ্বারা দূষিত অংশ স্পর্শ করার মাধ্যমে এটি সংক্রমিত হয়। কোভিড-১৯ ভাইরাস বেশ কয়েক ঘন্টা ভূপৃষ্ঠে বেঁচে থাকতে পারে, তবে সাধারণ জীবাণুনাশক এটিকে মেরে ফেলতে সক্ষম।"
    },
    {
      "question": "আমার কি মেডিক্যাল মাস্ক পরা উচিত?",
      "answer":
          "যদি মাস্ক পরা হয় তবে ভাইরাস সংক্রমণের বাড়তি ঝুঁকি এড়াতে অবশ্যই এর যথাযথ ব্যবহার করতে হবে এবং ব্যবহারের পর এগুলো যথাযথভাবে নির্দিষ্ট স্থানে ফেলে দিতে হবে।তবে শুধুমাত্র মাস্কের ব্যবহার এই ভাইরাসের সংক্রমন রোধ করার জন্য যথেষ্ট নয়। এর সাথে অবশ্যই ঘন ঘন হাত ধোয়া, হাঁচি ও কাশি ঢেকে রাখা, এবং ঠান্ডা লাগা বা ফ্লু-এর মতো লক্ষণ রয়েছে (কাশি, হাঁচি, জ্বর) এমন ব্যক্তির সংস্পর্শ এড়িয়ে চলা উচিত।"
    },
    {
      "question": "পরিবারের কোনও সদস্যের এই লক্ষণ দেখা দিলে কী করা উচিত?",
      "answer":
          'আপনার বা আপনার সন্তানের যদি জ্বর, কাশি বা শ্বাসকষ্ট থাকে তবে অবশ্যই চিকিৎসা সেবা নিতে হবে। কোভিড-১৯ সংক্রমিত হয়েছে এমন কোনও এলাকা যদি আপনি ভ্রমণ করে থাকেন, বা কোভিড-১৯ সংক্রমিত হয়েছে এমন কোনও এলাকা ভ্রমণ করেছে ও শ্বাসতন্ত্রের জটিলতার লক্ষণ রয়েছে এমন কারও সাথে যদি আপনার ঘনিষ্ঠ যোগাযোগ হয়, তবে আগে থেকেই স্বাস্থ্য সেবাদানকারীর সাথে কথা বলুন।'
    },
    {
      "question": "সংক্রমণের ঝুঁকি আমি কীভাবে এড়াতে পারি?",
      "answer":
          " ঘন ঘন সাবান ও পানি দিয়ে বা অ্যালকোহলযু্ক্ত হাত-ধোয়ার সামগ্রী ব্যবহার করে আপনার হাত ধূয়ে নিন,কাশি বা হাঁচি দেবার সময় মুখ এবং নাক কনুই দিয়ে বা টিস্যু দিয়ে ঢেকে রাখুন। ব্যবহূত টিস্যুটি তাৎক্ষণিকভাবে নির্দিষ্ট স্থানে ফেলে দিন,ঠান্ডা লেগেছে বা জ্বরের লক্ষণ আছে এমন ব্যক্তির সংস্পর্শ এড়িয়ে চলুন,আপনার বা আপনার সন্তানের জ্বর, কাশি বা শ্বাসকষ্ট হলে দ্রুত চিকিৎসা সেবা নিন"
    },
    {
      "question": " উপসর্গ দেখা দিলে!!!",
      "answer":
          "নতুন হটলাইন নম্বর ১৬২৬৩,সেই সাথে অব্যাহত চাপ কমাতে শিগগিরই জানিয়ে দেয়া হবে আরো ৮টি নতুন নম্বর।এছাড়া পুরনো হটলাইন নম্বরগুলোও চালু থাকবে। এগুলো হলো:০১৯৩৭০০০০১১,০১৯৩৭১১০০১১,০১৯২৭৭১১৭৮৪,০১৯২৭৭১১৭৮৫"
    },
  ];
}
